#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shukujitsu.module.main.random_uuid.main: Refreshing state... [id=dd57cf5f-e283-90fb-f523-85d3e8f51967]
module.gbizinfo.module.main.random_uuid.main: Refreshing state... [id=380cd54f-9d89-9107-356f-229c596fb92d]
module.base_registry_address.module.main.random_uuid.main: Refreshing state... [id=08924077-cbf6-c853-fd5f-a0fbef3deb81]
module.houjinbangou_latest.google_project_service.workflow["batch.googleapis.com"]: Refreshing state... [id=jpdata/batch.googleapis.com]
module.houjinbangou_latest.google_project_service.workflow["workflows.googleapis.com"]: Refreshing state... [id=jpdata/workflows.googleapis.com]
module.houjinbangou_latest.google_service_account.workflow_invoker: Refreshing state... [id=projects/jpdata/serviceAccounts/houjinbangou-latest-invoker@jpdata.iam.gserviceaccount.com]
module.houjinbangou_change_history_diff.google_service_account.workflow: Refreshing state... [id=projects/jpdata/serviceAccounts/houjinbangou-diff@jpdata.iam.gserviceaccount.com]
module.dataform.google_service_account.dataform_workflow_invoker: Refreshing state... [id=projects/jpdata/serviceAccounts/dataform-workflow-invoker@jpdata.iam.gserviceaccount.com]
google_storage_bucket.source_eventarc: Refreshing state... [id=jpdata-source-eventarc]
module.houjinbangou_latest.google_project_service.workflow["workflowexecutions.googleapis.com"]: Refreshing state... [id=jpdata/workflowexecutions.googleapis.com]
module.houjinbangou_latest.google_project_service.workflow["compute.googleapis.com"]: Refreshing state... [id=jpdata/compute.googleapis.com]
module.houjinbangou_change_history_diff.google_cloudbuild_trigger.workflow: Refreshing state... [id=projects/jpdata/triggers/2212ca83-c392-4997-beec-630deb3a9743]
module.houjinbangou_latest.google_project_service.workflow["cloudbuild.googleapis.com"]: Refreshing state... [id=jpdata/cloudbuild.googleapis.com]
module.houjinbangou_latest.google_project_service.workflow["iam.googleapis.com"]: Refreshing state... [id=jpdata/iam.googleapis.com]
module.houjinbangou_latest.google_project_service.workflow["cloudscheduler.googleapis.com"]: Refreshing state... [id=jpdata/cloudscheduler.googleapis.com]
module.houjinbangou_latest.google_project_service.workflow["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=jpdata/cloudresourcemanager.googleapis.com]
module.podb.google_storage_bucket.main: Refreshing state... [id=podb]
module.podb.google_service_account.podb: Refreshing state... [id=projects/jpdata/serviceAccounts/scheduled-query-podb@jpdata.iam.gserviceaccount.com]
module.base_registry_address.module.main.google_service_account.main: Refreshing state... [id=projects/jpdata/serviceAccounts/http-bq-base-regist@jpdata.iam.gserviceaccount.com]
module.shukujitsu.module.main.data.google_project.project: Reading...
module.shukujitsu.module.main.data.google_project.project: Read complete after 0s [id=projects/jpdata]
module.shukujitsu.module.main.google_service_account.main: Refreshing state... [id=projects/jpdata/serviceAccounts/http-bq-shukujitsu@jpdata.iam.gserviceaccount.com]
module.houjinbangou_change_history_diff.google_secret_manager_secret.houjinbangou_webapi_id: Refreshing state... [id=projects/jpdata/secrets/houjinbangou-webapi-id]
google_storage_bucket.source: Refreshing state... [id=jpdata-source]
module.houjinbangou_latest.google_service_account.workflow: Refreshing state... [id=projects/jpdata/serviceAccounts/houjinbangou-latest@jpdata.iam.gserviceaccount.com]
module.gbizinfo.module.main.google_storage_bucket.main: Refreshing state... [id=http-bq-gbizinfo]
google_project_service.project["artifactregistry.googleapis.com"]: Refreshing state... [id=jpdata/artifactregistry.googleapis.com]
module.dataform.google_project_service.project["workflows.googleapis.com"]: Refreshing state... [id=jpdata/workflows.googleapis.com]
google_project_service.project["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=jpdata/cloudresourcemanager.googleapis.com]
module.dataform.google_project_service.project["secretmanager.googleapis.com"]: Refreshing state... [id=jpdata/secretmanager.googleapis.com]
module.dataform.google_project_service.project["workflowexecutions.googleapis.com"]: Refreshing state... [id=jpdata/workflowexecutions.googleapis.com]
module.dataform.google_project_service.project["dataform.googleapis.com"]: Refreshing state... [id=jpdata/dataform.googleapis.com]
module.daily.google_project_service.workflow["cloudscheduler.googleapis.com"]: Refreshing state... [id=jpdata/cloudscheduler.googleapis.com]
module.dataform.google_project_service.project["iam.googleapis.com"]: Refreshing state... [id=jpdata/iam.googleapis.com]
module.dataform.google_project_service.project["pubsub.googleapis.com"]: Refreshing state... [id=jpdata/pubsub.googleapis.com]
module.dataform.google_project_service.project["cloudbuild.googleapis.com"]: Refreshing state... [id=jpdata/cloudbuild.googleapis.com]
module.houjinbangou_latest.google_cloudbuild_trigger.workflow: Refreshing state... [id=projects/jpdata/triggers/d7bac6a6-4331-4e21-a71c-16aabe7736a8]
module.daily.google_project_service.workflow["iam.googleapis.com"]: Refreshing state... [id=jpdata/iam.googleapis.com]
module.daily.google_project_service.workflow["workflowexecutions.googleapis.com"]: Refreshing state... [id=jpdata/workflowexecutions.googleapis.com]
module.daily.google_service_account.service_account: Refreshing state... [id=projects/jpdata/serviceAccounts/wf-daily@jpdata.iam.gserviceaccount.com]
module.dataform.google_project_iam_member.eventarc_gs: Refreshing state... [id=jpdata/roles/pubsub.publisher/serviceAccount:service-120299025068@gs-project-accounts.iam.gserviceaccount.com]
module.daily.google_project_service.workflow["workflows.googleapis.com"]: Refreshing state... [id=jpdata/workflows.googleapis.com]
module.dataform.google_project_iam_member.default["roles/bigquery.dataOwner"]: Refreshing state... [id=jpdata/roles/bigquery.dataOwner/serviceAccount:service-120299025068@gcp-sa-dataform.iam.gserviceaccount.com]
module.workload_identity_pool.google_service_account.terraform_plan: Refreshing state... [id=projects/jpdata/serviceAccounts/github-actions-terraform-plan@jpdata.iam.gserviceaccount.com]
module.podb.data.google_project.main: Reading...
module.base_registry_address.module.main.google_storage_bucket.main: Refreshing state... [id=http-bq-base-registry-address]
google_artifact_registry_repository.source: Refreshing state... [id=projects/jpdata/locations/asia-northeast1/repositories/source]
module.dataform.google_service_account.dataform: Refreshing state... [id=projects/jpdata/serviceAccounts/dataform@jpdata.iam.gserviceaccount.com]
module.dataform.google_project_iam_member.default["roles/dataform.serviceAgent"]: Refreshing state... [id=jpdata/roles/dataform.serviceAgent/serviceAccount:service-120299025068@gcp-sa-dataform.iam.gserviceaccount.com]
module.dataform.google_project_iam_member.default["roles/bigquery.jobUser"]: Refreshing state... [id=jpdata/roles/bigquery.jobUser/serviceAccount:service-120299025068@gcp-sa-dataform.iam.gserviceaccount.com]
module.dataform.google_project_iam_member.default["roles/storage.objectViewer"]: Refreshing state... [id=jpdata/roles/storage.objectViewer/serviceAccount:service-120299025068@gcp-sa-dataform.iam.gserviceaccount.com]
module.gbizinfo.module.main.google_service_account.main: Refreshing state... [id=projects/jpdata/serviceAccounts/http-bq-gbizinfo@jpdata.iam.gserviceaccount.com]
module.dataform.google_secret_manager_secret.github_personal_access_token: Refreshing state... [id=projects/jpdata/secrets/github-personal-access-token]
module.shukujitsu.module.main.google_storage_bucket.main: Refreshing state... [id=http-bq-shukujitsu]
module.workload_identity_pool.google_service_account.terraform_apply: Refreshing state... [id=projects/jpdata/serviceAccounts/github-actions-terraform-apply@jpdata.iam.gserviceaccount.com]
module.houjinbangou_change_history_diff.google_service_account.workflow_invoker: Refreshing state... [id=projects/jpdata/serviceAccounts/houjinbangou-diff-invoker@jpdata.iam.gserviceaccount.com]
module.podb.data.google_project.main: Read complete after 0s [id=projects/jpdata]
module.gbizinfo.module.main.data.google_project.project: Reading...
module.houjinbangou_change_history_diff.data.google_compute_default_service_account.default: Reading...
module.base_registry_address.module.main.data.google_project.project: Reading...
module.gbizinfo.module.main.data.google_project.project: Read complete after 0s [id=projects/jpdata]
module.houjinbangou_change_history_diff.google_project_service.workflow["workflows.googleapis.com"]: Refreshing state... [id=jpdata/workflows.googleapis.com]
module.tweakle.google_cloudbuild_trigger.workflow: Refreshing state... [id=projects/jpdata/triggers/8fa70872-ccc7-4b9c-b10b-83d88f49367d]
module.houjinbangou_change_history_diff.google_project_service.workflow["secretmanager.googleapis.com"]: Refreshing state... [id=jpdata/secretmanager.googleapis.com]
module.base_registry_address.module.main.data.google_project.project: Read complete after 0s [id=projects/jpdata]
module.houjinbangou_change_history_diff.google_project_service.workflow["batch.googleapis.com"]: Refreshing state... [id=jpdata/batch.googleapis.com]
module.houjinbangou_change_history_diff.google_project_service.workflow["compute.googleapis.com"]: Refreshing state... [id=jpdata/compute.googleapis.com]
module.houjinbangou_change_history_diff.data.google_compute_default_service_account.default: Read complete after 0s [id=projects/jpdata/serviceAccounts/120299025068-compute@developer.gserviceaccount.com]
module.houjinbangou_change_history_diff.google_project_service.workflow["iam.googleapis.com"]: Refreshing state... [id=jpdata/iam.googleapis.com]
module.houjinbangou_change_history_diff.google_project_service.workflow["workflowexecutions.googleapis.com"]: Refreshing state... [id=jpdata/workflowexecutions.googleapis.com]
module.houjinbangou_change_history_diff.google_project_service.workflow["cloudbuild.googleapis.com"]: Refreshing state... [id=jpdata/cloudbuild.googleapis.com]
module.houjinbangou_change_history_diff.google_project_service.workflow["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=jpdata/cloudresourcemanager.googleapis.com]
module.houjinbangou_change_history_diff.google_project_service.workflow["cloudscheduler.googleapis.com"]: Refreshing state... [id=jpdata/cloudscheduler.googleapis.com]
module.workload_identity_pool.google_project_service.main: Refreshing state... [id=jpdata/iamcredentials.googleapis.com]
google_project_iam_member.health_dashboard: Refreshing state... [id=jpdata/roles/bigquery.metadataViewer/user:na0@bqfun.jp]
google_service_account.daily: Refreshing state... [id=projects/jpdata/serviceAccounts/daily-invoker@jpdata.iam.gserviceaccount.com]
module.analyticshub.data.google_project.project: Reading...
module.houjinbangou_latest.data.google_compute_default_service_account.default: Reading...
module.dataform.google_project_iam_member.eventarc_pubsub: Refreshing state... [id=jpdata/roles/iam.serviceAccountTokenCreator/serviceAccount:service-120299025068@gcp-sa-pubsub.iam.gserviceaccount.com]
module.dataform.google_cloudbuild_trigger.dataform: Refreshing state... [id=projects/jpdata/triggers/80c6a3f5-1636-4f1d-89e9-d0cde2c64a3e]
module.podb.data.google_project.project: Reading...
module.podb.google_bigquery_analytics_hub_data_exchange.podb_us: Refreshing state... [id=projects/jpdata/locations/US/dataExchanges/podb__us]
module.dataform.google_cloudbuild_trigger.bqfunc: Refreshing state... [id=projects/jpdata/triggers/ed709987-a1a6-4de1-bce4-50c7ae960b95]
module.dataform.google_project_iam_member.eventarc["roles/workflows.invoker"]: Refreshing state... [id=jpdata/roles/workflows.invoker/serviceAccount:dataform-workflow-invoker@jpdata.iam.gserviceaccount.com]
module.dataform.google_project_iam_member.eventarc["roles/eventarc.eventReceiver"]: Refreshing state... [id=jpdata/roles/eventarc.eventReceiver/serviceAccount:dataform-workflow-invoker@jpdata.iam.gserviceaccount.com]
module.dataform.google_project_iam_member.eventarc["roles/logging.logWriter"]: Refreshing state... [id=jpdata/roles/logging.logWriter/serviceAccount:dataform-workflow-invoker@jpdata.iam.gserviceaccount.com]
module.houjinbangou_change_history_diff.google_project_iam_member.workflow["roles/workflows.invoker"]: Refreshing state... [id=jpdata/roles/workflows.invoker/serviceAccount:houjinbangou-diff@jpdata.iam.gserviceaccount.com]
module.houjinbangou_change_history_diff.google_project_iam_member.workflow["roles/batch.jobsEditor"]: Refreshing state... [id=jpdata/roles/batch.jobsEditor/serviceAccount:houjinbangou-diff@jpdata.iam.gserviceaccount.com]
module.houjinbangou_latest.google_project_iam_member.workflow_invoker: Refreshing state... [id=jpdata/roles/workflows.invoker/serviceAccount:houjinbangou-latest-invoker@jpdata.iam.gserviceaccount.com]
module.analyticshub.data.google_project.project: Read complete after 0s [id=projects/jpdata]
module.podb.google_storage_bucket_iam_member.main: Refreshing state... [id=b/podb/roles/storage.legacyBucketWriter/serviceAccount:k05e00000@gcpuscentral1-1dfa.iam.gserviceaccount.com]
module.houjinbangou_latest.data.google_compute_default_service_account.default: Read complete after 0s [id=projects/jpdata/serviceAccounts/120299025068-compute@developer.gserviceaccount.com]
module.podb.google_storage_bucket_iam_member.podb: Refreshing state... [id=b/podb/roles/storage.objectViewer/serviceAccount:scheduled-query-podb@jpdata.iam.gserviceaccount.com]
module.base_registry_address.module.main.google_bigquery_data_transfer_config.main: Refreshing state... [id=projects/120299025068/locations/asia-northeast1/transferConfigs/643556a1-0000-2e00-904f-94eb2c0dd15e]
module.base_registry_address.module.main.google_cloud_run_service.main: Refreshing state... [id=locations/us-west1/namespaces/jpdata/services/http-bq-base-registry-address]
module.podb.data.google_project.project: Read complete after 0s [id=projects/jpdata]
module.shukujitsu.module.main.google_bigquery_data_transfer_config.main: Refreshing state... [id=projects/120299025068/locations/asia-northeast1/transferConfigs/64354adc-0000-2c2c-873e-94eb2c181d64]
module.shukujitsu.module.main.google_project_iam_member.main: Refreshing state... [id=jpdata/roles/bigquery.admin/serviceAccount:http-bq-shukujitsu@jpdata.iam.gserviceaccount.com]
module.shukujitsu.module.main.google_cloud_run_service.main: Refreshing state... [id=locations/us-west1/namespaces/jpdata/services/http-bq-shukujitsu]
module.houjinbangou_change_history_diff.google_secret_manager_secret_iam_member.houjinbangou_webapi_id: Refreshing state... [id=projects/jpdata/secrets/houjinbangou-webapi-id/roles/secretmanager.secretAccessor/serviceAccount:120299025068-compute@developer.gserviceaccount.com]
module.houjinbangou_latest.google_project_iam_member.workflow: Refreshing state... [id=jpdata/roles/batch.jobsEditor/serviceAccount:houjinbangou-latest@jpdata.iam.gserviceaccount.com]
module.base_registry_address.module.main.google_storage_bucket_iam_member.main: Refreshing state... [id=b/http-bq-base-registry-address/roles/storage.objectAdmin/serviceAccount:http-bq-base-regist@jpdata.iam.gserviceaccount.com]
module.dataform.google_project_iam_member.dataform["roles/dataform.editor"]: Refreshing state... [id=jpdata/roles/dataform.editor/serviceAccount:dataform@jpdata.iam.gserviceaccount.com]
module.dataform.google_project_iam_member.dataform["roles/logging.logWriter"]: Refreshing state... [id=jpdata/roles/logging.logWriter/serviceAccount:dataform@jpdata.iam.gserviceaccount.com]
module.daily.google_project_iam_member.service_account: Refreshing state... [id=jpdata/roles/workflows.invoker/serviceAccount:wf-daily@jpdata.iam.gserviceaccount.com]
module.workload_identity_pool.google_storage_bucket_iam_member.terraform_plan: Refreshing state... [id=b/jpdata-tfstate/roles/storage.admin/serviceAccount:github-actions-terraform-plan@jpdata.iam.gserviceaccount.com]
module.workload_identity_pool.google_project_iam_member.terraform_plan: Refreshing state... [id=jpdata/roles/viewer/serviceAccount:github-actions-terraform-plan@jpdata.iam.gserviceaccount.com]
module.gbizinfo.module.main.google_bigquery_data_transfer_config.main: Refreshing state... [id=projects/120299025068/locations/asia-northeast1/transferConfigs/64354296-0000-2057-9d30-94eb2c1aee86]
module.gbizinfo.module.main.google_cloud_run_service.main: Refreshing state... [id=locations/us-west1/namespaces/jpdata/services/http-bq-gbizinfo]
module.gbizinfo.module.main.google_storage_bucket_iam_member.main: Refreshing state... [id=b/http-bq-gbizinfo/roles/storage.objectAdmin/serviceAccount:http-bq-gbizinfo@jpdata.iam.gserviceaccount.com]
module.dataform.google_secret_manager_secret_iam_member.github_personal_access_token: Refreshing state... [id=projects/jpdata/secrets/github-personal-access-token/roles/secretmanager.secretAccessor/serviceAccount:service-120299025068@gcp-sa-dataform.iam.gserviceaccount.com]
module.dataform.google_dataform_repository.jpdata: Refreshing state... [id=projects/jpdata/locations/asia-northeast1/repositories/jpdata-dataform]
module.dataform.google_dataform_repository.bqfunc: Refreshing state... [id=projects/jpdata/locations/asia-northeast1/repositories/bqfunc]
module.podb.google_project_iam_member.main: Refreshing state... [id=jpdata/roles/iam.serviceAccountTokenCreator/serviceAccount:service-120299025068@gcp-sa-bigquerydatatransfer.iam.gserviceaccount.com]
module.podb.google_project_iam_member.podb: Refreshing state... [id=jpdata/roles/bigquery.admin/serviceAccount:scheduled-query-podb@jpdata.iam.gserviceaccount.com]
module.houjinbangou_change_history_diff.google_project_iam_member.workflow_invoker: Refreshing state... [id=jpdata/roles/workflows.invoker/serviceAccount:houjinbangou-diff-invoker@jpdata.iam.gserviceaccount.com]
module.workload_identity_pool.google_project_iam_member.terraform_apply: Refreshing state... [id=jpdata/roles/owner/serviceAccount:github-actions-terraform-apply@jpdata.iam.gserviceaccount.com]
module.workload_identity_pool.google_storage_bucket_iam_member.terraform_apply: Refreshing state... [id=b/jpdata-tfstate/roles/storage.admin/serviceAccount:github-actions-terraform-apply@jpdata.iam.gserviceaccount.com]
module.gbizinfo.module.main.google_project_iam_member.main: Refreshing state... [id=jpdata/roles/bigquery.admin/serviceAccount:http-bq-gbizinfo@jpdata.iam.gserviceaccount.com]
module.shukujitsu.module.main.google_storage_bucket_iam_member.main: Refreshing state... [id=b/http-bq-shukujitsu/roles/storage.objectAdmin/serviceAccount:http-bq-shukujitsu@jpdata.iam.gserviceaccount.com]
module.base_registry_address.module.main.google_project_iam_member.main: Refreshing state... [id=jpdata/roles/bigquery.admin/serviceAccount:http-bq-base-regist@jpdata.iam.gserviceaccount.com]
module.houjinbangou_change_history_diff.google_service_account_iam_member.workflow: Refreshing state... [id=projects/jpdata/serviceAccounts/120299025068-compute@developer.gserviceaccount.com/roles/iam.serviceAccountUser/serviceAccount:houjinbangou-diff@jpdata.iam.gserviceaccount.com]
google_project_iam_member.daily: Refreshing state... [id=jpdata/roles/workflows.invoker/serviceAccount:daily-invoker@jpdata.iam.gserviceaccount.com]
module.podb.google_bigquery_analytics_hub_data_exchange_iam_member.member_us: Refreshing state... [id=projects/jpdata/locations/US/dataExchanges/podb__us/roles/analyticshub.subscriber/allAuthenticatedUsers]
module.analyticshub.google_bigquery_analytics_hub_data_exchange.jpdata_us: Refreshing state... [id=projects/jpdata/locations/US/dataExchanges/us_jpdata_1877561be8d]
module.analyticshub.google_bigquery_analytics_hub_data_exchange.jpdata: Refreshing state... [id=projects/120299025068/locations/asia-northeast1/dataExchanges/jpdata_18253a34a30]
module.analyticshub.google_project_service.main["iam.googleapis.com"]: Refreshing state... [id=120299025068/iam.googleapis.com]
module.analyticshub.google_project_service.main["analyticshub.googleapis.com"]: Refreshing state... [id=120299025068/analyticshub.googleapis.com]
module.houjinbangou_latest.google_service_account_iam_member.workflow: Refreshing state... [id=projects/jpdata/serviceAccounts/120299025068-compute@developer.gserviceaccount.com/roles/iam.serviceAccountUser/serviceAccount:houjinbangou-latest@jpdata.iam.gserviceaccount.com]
module.podb.google_bigquery_analytics_hub_listing.podb_us["PODB_JAPANESE_PREFECTURE_DATA__US"]: Refreshing state... [id=projects/jpdata/locations/US/dataExchanges/podb__us/listings/japanese_prefecture_data]
module.podb.google_bigquery_analytics_hub_listing.podb_us["PODB_JAPANESE_CALENDAR_DATA__US"]: Refreshing state... [id=projects/jpdata/locations/US/dataExchanges/podb__us/listings/japanese_calendar_data]
module.podb.google_bigquery_analytics_hub_listing.podb_us["PODB_JAPANESE_CITY_DATA__US"]: Refreshing state... [id=projects/jpdata/locations/US/dataExchanges/podb__us/listings/japanese_city_data]
module.podb.google_bigquery_analytics_hub_listing.podb_us["PODB_JAPANESE_LAND_PRICE_DATA__US"]: Refreshing state... [id=projects/jpdata/locations/US/dataExchanges/podb__us/listings/japanese_land_price_data]
module.podb.google_bigquery_analytics_hub_listing.podb_us["PODB_JAPANESE_WEATHER_DATA__US"]: Refreshing state... [id=projects/jpdata/locations/US/dataExchanges/podb__us/listings/japanese_weather_data]
module.podb.google_bigquery_analytics_hub_listing.podb_us["PODB_JAPANESE_STATION_AND_RAILWAY_DATA__US"]: Refreshing state... [id=projects/jpdata/locations/US/dataExchanges/podb__us/listings/japanese_station_and_railway_data]
module.podb.google_bigquery_analytics_hub_listing.podb_us["PODB_JAPANESE_MEDICAL_DATA__US"]: Refreshing state... [id=projects/jpdata/locations/US/dataExchanges/podb__us/listings/japanese_medical_data]
module.podb.google_bigquery_analytics_hub_listing.podb_us["PODB_JAPANESE_MESH_DATA__US"]: Refreshing state... [id=projects/jpdata/locations/US/dataExchanges/podb__us/listings/japanese_mesh_data]
module.podb.google_bigquery_analytics_hub_listing.podb_us["PODB_JAPANESE_CORPORATE_DATA__US"]: Refreshing state... [id=projects/jpdata/locations/US/dataExchanges/podb__us/listings/japanese_corporate_data]
module.podb.google_bigquery_analytics_hub_listing.podb_us["PODB_JAPANESE_STREET_DATA__US"]: Refreshing state... [id=projects/jpdata/locations/US/dataExchanges/podb__us/listings/japanese_street_data]
module.houjinbangou_latest.google_storage_bucket_iam_member.cloud_batch: Refreshing state... [id=b/jpdata-source-eventarc/roles/storage.objectAdmin/serviceAccount:120299025068-compute@developer.gserviceaccount.com]
module.houjinbangou_change_history_diff.google_storage_bucket_iam_member.cloud_batch: Refreshing state... [id=b/jpdata-source/roles/storage.objectAdmin/serviceAccount:120299025068-compute@developer.gserviceaccount.com]
module.base_registry_address.module.main.google_cloud_run_service_iam_member.main: Refreshing state... [id=v1/projects/jpdata/locations/us-west1/services/http-bq-base-registry-address/roles/run.invoker/serviceAccount:http-bq-base-regist@jpdata.iam.gserviceaccount.com]
module.base_registry_address.module.main.google_workflows_workflow.main: Refreshing state... [id=projects/jpdata/locations/us-west1/workflows/http-bq-base-registry-address]
module.shukujitsu.module.main.google_workflows_workflow.main: Refreshing state... [id=projects/jpdata/locations/us-west1/workflows/http-bq-shukujitsu]
module.shukujitsu.module.main.google_cloud_run_service_iam_member.main: Refreshing state... [id=v1/projects/jpdata/locations/us-west1/services/http-bq-shukujitsu/roles/run.invoker/serviceAccount:http-bq-shukujitsu@jpdata.iam.gserviceaccount.com]
module.gbizinfo.module.main.google_cloud_run_service_iam_member.main: Refreshing state... [id=v1/projects/jpdata/locations/us-west1/services/http-bq-gbizinfo/roles/run.invoker/serviceAccount:http-bq-gbizinfo@jpdata.iam.gserviceaccount.com]
module.gbizinfo.module.main.google_workflows_workflow.main: Refreshing state... [id=projects/jpdata/locations/us-west1/workflows/http-bq-gbizinfo]
module.houjinbangou_latest.google_workflows_workflow.workflow: Refreshing state... [id=projects/jpdata/locations/asia-northeast1/workflows/houjinbangou_latest]
module.podb.google_bigquery_data_transfer_config.main: Refreshing state... [id=projects/120299025068/locations/us/transferConfigs/66c77431-0000-2a82-8bbe-d4f547f77d64]
module.analyticshub.google_bigquery_analytics_hub_data_exchange_iam_member.member_us: Refreshing state... [id=projects/jpdata/locations/US/dataExchanges/us_jpdata_1877561be8d/roles/analyticshub.subscriber/allAuthenticatedUsers]
module.analyticshub.google_bigquery_analytics_hub_listing.jp_holidays_us: Refreshing state... [id=projects/jpdata/locations/US/dataExchanges/us_jpdata_1877561be8d/listings/jp_holidays_preprocessed_by_bq_fun_18253c4e9dc]
module.analyticshub.google_bigquery_analytics_hub_listing.base_registry_address_us: Refreshing state... [id=projects/jpdata/locations/US/dataExchanges/us_jpdata_1877561be8d/listings/base_registry_address_preprocessed_by_bq_fun_123456789ab]
module.analyticshub.google_bigquery_analytics_hub_listing.gbizinfo_us: Refreshing state... [id=projects/jpdata/locations/US/dataExchanges/us_jpdata_1877561be8d/listings/gbizinfo_preprocessed_by_bq_fun_18253b3389d]
module.analyticshub.google_bigquery_analytics_hub_listing.corporate_number: Refreshing state... [id=projects/120299025068/locations/asia-northeast1/dataExchanges/jpdata_18253a34a30/listings/corporate_number_preprocessed_by_bq_fun_1843bbd5a18]
module.analyticshub.google_bigquery_analytics_hub_listing.gbizinfo: Refreshing state... [id=projects/120299025068/locations/asia-northeast1/dataExchanges/jpdata_18253a34a30/listings/gbizinfo_preprocessed_by_bq_fun_18253b3389d]
module.analyticshub.google_bigquery_analytics_hub_listing.jp_holidays: Refreshing state... [id=projects/120299025068/locations/asia-northeast1/dataExchanges/jpdata_18253a34a30/listings/jp_holidays_preprocessed_by_bq_fun_18253c4e9dc]
module.analyticshub.google_bigquery_analytics_hub_listing.base_registry_address: Refreshing state... [id=projects/120299025068/locations/asia-northeast1/dataExchanges/jpdata_18253a34a30/listings/base_registry_address_preprocessed_by_bq_fun_123456789ab]
module.analyticshub.google_bigquery_analytics_hub_data_exchange_iam_member.member: Refreshing state... [id=projects/120299025068/locations/asia-northeast1/dataExchanges/jpdata_18253a34a30/roles/analyticshub.subscriber/allAuthenticatedUsers]
module.dataform.google_workflows_workflow.dataform: Refreshing state... [id=projects/jpdata/locations/asia-northeast1/workflows/dataform]
module.dataform.google_workflows_workflow.bqfunc: Refreshing state... [id=projects/jpdata/locations/asia-northeast1/workflows/bqfunc]
module.workload_identity_pool.google_iam_workload_identity_pool.plan: Refreshing state... [id=projects/jpdata/locations/global/workloadIdentityPools/github-actions-terraform-plan]
module.workload_identity_pool.google_iam_workload_identity_pool.apply: Refreshing state... [id=projects/jpdata/locations/global/workloadIdentityPools/github-actions-terraform-apply]
module.workload_identity_pool.google_service_account_iam_member.terraform_plan: Refreshing state... [id=projects/jpdata/serviceAccounts/github-actions-terraform-plan@jpdata.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/120299025068/locations/global/workloadIdentityPools/github-actions-terraform-plan/attribute.repository/bqfun/jpdata]
module.workload_identity_pool.google_iam_workload_identity_pool_provider.plan: Refreshing state... [id=projects/jpdata/locations/global/workloadIdentityPools/github-actions-terraform-plan/providers/plan]
module.workload_identity_pool.google_service_account_iam_member.terraform_apply: Refreshing state... [id=projects/jpdata/serviceAccounts/github-actions-terraform-apply@jpdata.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/120299025068/locations/global/workloadIdentityPools/github-actions-terraform-apply/attribute.repository/bqfun/jpdata]
module.workload_identity_pool.google_iam_workload_identity_pool_provider.apply: Refreshing state... [id=projects/jpdata/locations/global/workloadIdentityPools/github-actions-terraform-apply/providers/apply]
module.houjinbangou_latest.google_cloud_scheduler_job.workflow: Refreshing state... [id=projects/jpdata/locations/asia-northeast1/jobs/houjinbangou_latest]
module.daily.google_workflows_workflow.workflow: Refreshing state... [id=projects/jpdata/locations/asia-northeast1/workflows/daily]
module.houjinbangou_change_history_diff.google_workflows_workflow.workflow: Refreshing state... [id=projects/jpdata/locations/asia-northeast1/workflows/houjinbangou_change_history_diff]
module.dataform.google_eventarc_trigger.eventarc: Refreshing state... [id=projects/jpdata/locations/asia-northeast1/triggers/eventarc]
module.houjinbangou_change_history_diff.google_cloud_scheduler_job.workflow: Refreshing state... [id=projects/jpdata/locations/asia-northeast1/jobs/houjinbangou_change_history_diff]
module.daily.google_cloud_scheduler_job.workflow: Refreshing state... [id=projects/jpdata/locations/asia-northeast1/jobs/daily]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.podb.google_bigquery_analytics_hub_data_exchange.podb will be created
  + resource "google_bigquery_analytics_hub_data_exchange" "podb" {
      + data_exchange_id = "podb"
      + description      = "BigQuery ユーザコミュニティ BQ Fun にて、株式会社 truestar のデータ提供サービス Prepper Open Data Bank の BigQuery クローンを提供する。"
      + display_name     = "podb"
      + id               = (known after apply)
      + listing_count    = (known after apply)
      + location         = "asia-northeast1"
      + name             = (known after apply)
      + primary_contact  = "https://bqfun.jp/docs/podb/"
      + project          = "jpdata"
    }

  # module.podb.google_bigquery_analytics_hub_listing.podb["PODB_JAPANESE_CALENDAR_DATA"] will be created
  + resource "google_bigquery_analytics_hub_listing" "podb" {
      + data_exchange_id = "podb"
      + display_name     = "JAPANESE CALENDAR DATA"
      + documentation    = <<-EOT
            Japanese Calendar Data には、日付や曜日情報に加え、内閣府から毎年2月に発表される祝日と振替休日や、土日祝、平日、GW、年末年始、休前日など、様々な事業のマーケティング活動に影響のある軸で予めフラグ化するなど、日次データを用いた機械学習などのデータ分析ですぐに活用できる形に加工しています。
            
            例年2月に翌年末までの祝日・振替休日の情報が公開されるため、その後に翌年分を更新します。
            
            日本のカレンダー【JAPAN_CALENDAR】では2010年1月1日からデータを保持しています。SQLでの分析やシステム連携時に扱いやすいカラム名を持つテーブルと、TableauなどのBIツールで利用しやすい日本語および英語のカラム名にそれぞれ変更したビュー、計三種類をご用意しています。
            
            
            詳細な定義: https://podb.truestar.co.jp/archives/cal-data
            
            --
            株式会社 truestar が抽出、加工したデータ提供サービス Prepper Open Data Bank の BigQuery クローンです。
            BigQuery ユーザコミュニティ BQ FUN が加工して作成しています。BQ FUN および株式会社 truestar は、利用者が本コンテンツを用いて行う一切の責任を負いません。
            また、予告なく変更、削除される場合があります。
            
            このデータセットはCC BY 4.0で提供されています。
            https://creativecommons.org/licenses/by/4.0/legalcode.ja
        EOT
      + id               = (known after apply)
      + listing_id       = "japanese_calendar_data"
      + location         = "asia-northeast1"
      + name             = (known after apply)
      + primary_contact  = "https://bqfun.jp/docs/podb/"
      + project          = "jpdata"

      + bigquery_dataset {
          + dataset = "projects/120299025068/datasets/PODB_JAPANESE_CALENDAR_DATA"
        }
    }

  # module.podb.google_bigquery_analytics_hub_listing.podb["PODB_JAPANESE_CITY_DATA"] will be created
  + resource "google_bigquery_analytics_hub_listing" "podb" {
      + data_exchange_id = "podb"
      + display_name     = "JAPANESE CITY DATA"
      + documentation    = <<-EOT
            Prepper Open Data Bankは、様々な日本のオープンデータをデータプレップなしですぐ加工できるようにして提供しています。
            
            1．BETA版公開分
            JAPANESE CITY DATAは、政府統計ポータルサイト「e-stat」で公開されている日本の市区町村レベルの統計・空間データを、データ分析ですぐに活用できる形にtruestarが収集・加工したものです。このデータベースには、性別、年齢層別などに分類された総人口・労働者人口データなど様々な統計情報が含まれており、市区町村単位での分析で必要なデータを豊富に提供しています。
            
            調査統計量データとして、国勢調査と住宅・土地統計調査など、調査に応じてテーブルを区分せずに、一つのテーブル「市区町村調査統計量データ【CI_ST】」にまとめました。「市区町村調査統計量データ【CI_ST】」で示す各カラムの内容がわかりやすいように、統計調査属性情報のテーブル「市区町村統計量マスタ【CI_ST_MST】と統計調査概要情報のテーブル「市区町村調査マスタ【CI_TB_MST】」も作成しました。
            
            市区町村コードと市区町村名をまとめた「市区町村マスタ【CI_MST】」、国土地理院の役所情報に基づく「市区町村代表点データ【CI_GEO_PT】」、国土数値情報のポリゴンに基づく「市区町村ポリゴンデータ【CI_GEO_PG】」を地理情報として用意しています。
            
            また、ユーザーが必要な統計調査だけ使えるように、各統計調査の分類別や調査年別に最低限のカラムを付与したビューも共有しています。更に、市区町村マスタ【CI_MST】と結合し、市区町村コードと市区町村名が付与されています。
            
            2．本番公開分（E_PODB、J_PODBスキーマ）
            従来JAPANESE CENSUS&SPATIAL（略称：旧C&S）で公開していた市区町村レベルのデータも含まれます。
            
            ※市区町村代表点データは国土地理院の役所・役場の緯度・経度データを利用しています。しかし現在、ウェブサイトの更新に伴い、出典データにアクセスできなくなっております。次回国勢調査時においては、代替のオープンデータを使用して情報をお届けする予定です。
            
            
            詳細な定義: https://podb.truestar.co.jp/archives/city-data
            
            --
            株式会社 truestar が抽出、加工したデータ提供サービス Prepper Open Data Bank の BigQuery クローンです。
            BigQuery ユーザコミュニティ BQ FUN が加工して作成しています。BQ FUN および株式会社 truestar は、利用者が本コンテンツを用いて行う一切の責任を負いません。
            また、予告なく変更、削除される場合があります。
            
            このデータセットはCC BY 4.0で提供されています。
            https://creativecommons.org/licenses/by/4.0/legalcode.ja
        EOT
      + id               = (known after apply)
      + listing_id       = "japanese_city_data"
      + location         = "asia-northeast1"
      + name             = (known after apply)
      + primary_contact  = "https://bqfun.jp/docs/podb/"
      + project          = "jpdata"

      + bigquery_dataset {
          + dataset = "projects/120299025068/datasets/PODB_JAPANESE_CITY_DATA"
        }
    }

  # module.podb.google_bigquery_analytics_hub_listing.podb["PODB_JAPANESE_CORPORATE_DATA"] will be created
  + resource "google_bigquery_analytics_hub_listing" "podb" {
      + data_exchange_id = "podb"
      + display_name     = "JAPANESE CORPORATE DATA"
      + documentation    = <<-EOT
            Prepper Open Data Bankは、様々な日本のオープンデータをデータプレップなしですぐ加工できるようにして提供しています。
            
            Japanese Corporate Dataには、経済産業省のgBizINFOの公開データを元に、truestarが加工した日本国内の法人情報が入っています。
            gBizINFOには、国税庁、金融庁、厚生労働省、総務省など、政府保有のデータが複数連携・集約されており、それらのデータをダウンロードやAPIの仕様を理解することなく利活用できます。
            
            また、2023年3月から、株式会社TSUIDE及び法人番号株式会社が収集・加工した日本年金機構の従業員数（被保険者数）データを追加致しました。
            
            共有する法人情報には全て法人番号が含まれており、法人番号をキーに任意の企業の情報を簡単に抽出することが可能です。
            
            こちらに含まれるデータセットは以下の通りです。
            
            「日本法人の基本情報【CORP_BASIC】」のページでは、法人番号のデータをSalesforceに連携する方法を紹介したYoutube動画を載せています。
            
            【重要】お知らせ(2024.1.5)
            EMPLOYEEデータの収集・加工にかかるコスト負担が非常に高いことから、2024年2月の更新後、PODB上での運用方法を変更することとなりました。詳細は「日本法人の従業員数【CORP_EMPLOYEE】」ページからご確認ください。
            
            
            詳細な定義: https://podb.truestar.co.jp/archives/corp-data
            
            --
            株式会社 truestar が抽出、加工したデータ提供サービス Prepper Open Data Bank の BigQuery クローンです。
            BigQuery ユーザコミュニティ BQ FUN が加工して作成しています。BQ FUN および株式会社 truestar は、利用者が本コンテンツを用いて行う一切の責任を負いません。
            また、予告なく変更、削除される場合があります。
            
            このデータセットはCC BY 4.0で提供されています。
            https://creativecommons.org/licenses/by/4.0/legalcode.ja
        EOT
      + id               = (known after apply)
      + listing_id       = "japanese_corporate_data"
      + location         = "asia-northeast1"
      + name             = (known after apply)
      + primary_contact  = "https://bqfun.jp/docs/podb/"
      + project          = "jpdata"

      + bigquery_dataset {
          + dataset = "projects/120299025068/datasets/PODB_JAPANESE_CORPORATE_DATA"
        }
    }

  # module.podb.google_bigquery_analytics_hub_listing.podb["PODB_JAPANESE_LAND_PRICE_DATA"] will be created
  + resource "google_bigquery_analytics_hub_listing" "podb" {
      + data_exchange_id = "podb"
      + display_name     = "JAPANESE LAND PRICE DATA"
      + documentation    = <<-EOT
            Prepper Open Data Bankは、様々な日本のオープンデータをデータプレップなしですぐ加工できるようにして提供しています。
            
            Japanese Land Price Dataは、日本全国における、時系列の地価情報とその土地の最新の属性情報を保持しており、全国の土地間の比較が可能です。時系列の情報も１レコードに横持ちしたデータセットと、時系列の地価情報を縦持ちしたデータを共有しており、カラム名 PODB_LAND_PRICE_ID で結合をしてご活用いただくことが可能です。
            
            
            詳細な定義: https://podb.truestar.co.jp/archives/land-price-data
            
            --
            株式会社 truestar が抽出、加工したデータ提供サービス Prepper Open Data Bank の BigQuery クローンです。
            BigQuery ユーザコミュニティ BQ FUN が加工して作成しています。BQ FUN および株式会社 truestar は、利用者が本コンテンツを用いて行う一切の責任を負いません。
            また、予告なく変更、削除される場合があります。
            
            このデータセットはCC BY 4.0で提供されています。
            https://creativecommons.org/licenses/by/4.0/legalcode.ja
        EOT
      + id               = (known after apply)
      + listing_id       = "japanese_land_price_data"
      + location         = "asia-northeast1"
      + name             = (known after apply)
      + primary_contact  = "https://bqfun.jp/docs/podb/"
      + project          = "jpdata"

      + bigquery_dataset {
          + dataset = "projects/120299025068/datasets/PODB_JAPANESE_LAND_PRICE_DATA"
        }
    }

  # module.podb.google_bigquery_analytics_hub_listing.podb["PODB_JAPANESE_MEDICAL_DATA"] will be created
  + resource "google_bigquery_analytics_hub_listing" "podb" {
      + data_exchange_id = "podb"
      + display_name     = "JAPANESE MEDICAL DATA"
      + documentation    = <<-EOT
            Prepper Open Data Bankは、様々な日本のオープンデータをデータプレップなしですぐ加工できるようにして提供しています。
            
            Japanese Medical Dataは、日本全国の医療機関の位置情報と診療科目や病床数などの属性情報や、日本の医療圏の情報を提供しています。
            Snowflake Data Marketplaceに展開している他のデータセットと空間結合して分析を行うことで、最寄の医療機関の特定や距離計算などが容易に可能です。
            
            
            詳細な定義: https://podb.truestar.co.jp/archives/medical-data
            
            --
            株式会社 truestar が抽出、加工したデータ提供サービス Prepper Open Data Bank の BigQuery クローンです。
            BigQuery ユーザコミュニティ BQ FUN が加工して作成しています。BQ FUN および株式会社 truestar は、利用者が本コンテンツを用いて行う一切の責任を負いません。
            また、予告なく変更、削除される場合があります。
            
            このデータセットはCC BY 4.0で提供されています。
            https://creativecommons.org/licenses/by/4.0/legalcode.ja
        EOT
      + id               = (known after apply)
      + listing_id       = "japanese_medical_data"
      + location         = "asia-northeast1"
      + name             = (known after apply)
      + primary_contact  = "https://bqfun.jp/docs/podb/"
      + project          = "jpdata"

      + bigquery_dataset {
          + dataset = "projects/120299025068/datasets/PODB_JAPANESE_MEDICAL_DATA"
        }
    }

  # module.podb.google_bigquery_analytics_hub_listing.podb["PODB_JAPANESE_MESH_DATA"] will be created
  + resource "google_bigquery_analytics_hub_listing" "podb" {
      + data_exchange_id = "podb"
      + display_name     = "JAPANESE MESH DATA"
      + documentation    = <<-EOT
            Prepper Open Data Bankは、様々な日本のオープンデータをデータプレップなしですぐ加工できるようにして提供しています。
            
            Japanese Mesh Dataは、日本全国のメッシュ別の人流データや将来推計人口データを提供しています。（メッシュのみのデータセットも提供予定。）
            元データが所有する行政区域コードから都道府県名、市区町村名を付与しています。年齢区分や都道府県名、市区町村名でフィルタリングをすれば容易に必要な情報のみを抽出できます。
            自社店舗の商圏、進出予定地などのPOIと重ね合わせることで、需要予測等によりビジネスインパクトを分析することができます。
            
            
            詳細な定義: https://podb.truestar.co.jp/archives/mesh-data
            
            --
            株式会社 truestar が抽出、加工したデータ提供サービス Prepper Open Data Bank の BigQuery クローンです。
            BigQuery ユーザコミュニティ BQ FUN が加工して作成しています。BQ FUN および株式会社 truestar は、利用者が本コンテンツを用いて行う一切の責任を負いません。
            また、予告なく変更、削除される場合があります。
            
            このデータセットはCC BY 4.0で提供されています。
            https://creativecommons.org/licenses/by/4.0/legalcode.ja
        EOT
      + id               = (known after apply)
      + listing_id       = "japanese_mesh_data"
      + location         = "asia-northeast1"
      + name             = (known after apply)
      + primary_contact  = "https://bqfun.jp/docs/podb/"
      + project          = "jpdata"

      + bigquery_dataset {
          + dataset = "projects/120299025068/datasets/PODB_JAPANESE_MESH_DATA"
        }
    }

  # module.podb.google_bigquery_analytics_hub_listing.podb["PODB_JAPANESE_PREFECTURE_DATA"] will be created
  + resource "google_bigquery_analytics_hub_listing" "podb" {
      + data_exchange_id = "podb"
      + display_name     = "JAPANESE PREFECTURE DATA"
      + documentation    = <<-EOT
            Prepper Open Data Bankは、様々な日本のオープンデータをデータプレップなしですぐ加工できるようにして提供しています。
            
            1．旧C&Sのビュー
            2023年9月より、従来JAPANESE CENSUS&SPATIAL(略称：旧C&S)で公開していた都道府県レベルのデータが含まれます。
            
            また、以下について、近日公開予定です。
            
            Japanese Prefecture Dataは、政府統計ポータルサイト「e-stat」で公開されている日本の都道府県レベルの統計・空間データを、データ分析ですぐに活用できる形にtruestarが収集・加工したものです。このデータベースには、性別、年齢層別などに分類された総人口・労働者人口データなど様々な統計情報が含まれており、都道府県単位での分析で必要なデータを豊富に提供しています。
            
            調査統計量データとして、国勢調査と住宅・土地統計調査など、調査に応じてテーブルを区分せずに、一つのテーブル「都道府県調査統計量データ【PR_ST】」にまとめました。「都道府県調査統計量データ【PR_ST】」で示す各カラムの内容がわかりやすいように、統計調査属性情報のテーブル「都道府県統計量マスタ【PR_ST_MST】と統計調査概要情報のテーブル「都道府県調査マスタ【PR_TB_MST】」も作成しました。
            
            都道府県コードと都道府県名をまとめた「都道府県マスタ【PR_MST】」、国土地理院の役所情報に基づく「都道府県代表点データ【PR_GEO_PT】」、国土数値情報のポリゴンに基づく「都道府県ポリゴンデータ【PR_GEO_PG】」を地理情報として用意しています。
            
            また、ユーザーが必要な統計調査だけ使えるように、各統計調査の分類別や調査年別に最低限のカラムを付与したビューも共有しています。更に、都道府県マスタ【PR_MST】と結合し、都道府県コードと都道府県名が付与されています。
            
            2．本番公開分（E_PODB、J_PODBスキーマ）
            従来JAPANESE CENSUS&SPATIAL（略称：旧C&S）で公開していた都道府県レベルのデータも含まれます。
            
            
            詳細な定義: https://podb.truestar.co.jp/archives/pref-data
            
            --
            株式会社 truestar が抽出、加工したデータ提供サービス Prepper Open Data Bank の BigQuery クローンです。
            BigQuery ユーザコミュニティ BQ FUN が加工して作成しています。BQ FUN および株式会社 truestar は、利用者が本コンテンツを用いて行う一切の責任を負いません。
            また、予告なく変更、削除される場合があります。
            
            このデータセットはCC BY 4.0で提供されています。
            https://creativecommons.org/licenses/by/4.0/legalcode.ja
        EOT
      + id               = (known after apply)
      + listing_id       = "japanese_prefecture_data"
      + location         = "asia-northeast1"
      + name             = (known after apply)
      + primary_contact  = "https://bqfun.jp/docs/podb/"
      + project          = "jpdata"

      + bigquery_dataset {
          + dataset = "projects/120299025068/datasets/PODB_JAPANESE_PREFECTURE_DATA"
        }
    }

  # module.podb.google_bigquery_analytics_hub_listing.podb["PODB_JAPANESE_STATION_AND_RAILWAY_DATA"] will be created
  + resource "google_bigquery_analytics_hub_listing" "podb" {
      + data_exchange_id = "podb"
      + display_name     = "JAPANESE STATION AND RAILWAY DATA"
      + documentation    = <<-EOT
            Prepper Open Data Bankは、様々な日本のオープンデータをデータプレップなしですぐ加工できるようにして提供しています。
            
            Japanese Station and Railway Dataは、日本全国の鉄道の路線や駅について、ポイント及びポリラインデータを保有しています。
            Snowflake Data Marketplaceに展開している他のデータセットと空間結合して分析を行うことで、最寄駅の特定や距離計算などが容易に可能です。
            
            
            詳細な定義: https://podb.truestar.co.jp/archives/sr-data
            
            --
            株式会社 truestar が抽出、加工したデータ提供サービス Prepper Open Data Bank の BigQuery クローンです。
            BigQuery ユーザコミュニティ BQ FUN が加工して作成しています。BQ FUN および株式会社 truestar は、利用者が本コンテンツを用いて行う一切の責任を負いません。
            また、予告なく変更、削除される場合があります。
            
            このデータセットはCC BY 4.0で提供されています。
            https://creativecommons.org/licenses/by/4.0/legalcode.ja
        EOT
      + id               = (known after apply)
      + listing_id       = "japanese_station_and_railway_data"
      + location         = "asia-northeast1"
      + name             = (known after apply)
      + primary_contact  = "https://bqfun.jp/docs/podb/"
      + project          = "jpdata"

      + bigquery_dataset {
          + dataset = "projects/120299025068/datasets/PODB_JAPANESE_STATION_AND_RAILWAY_DATA"
        }
    }

  # module.podb.google_bigquery_analytics_hub_listing.podb["PODB_JAPANESE_STREET_DATA"] will be created
  + resource "google_bigquery_analytics_hub_listing" "podb" {
      + data_exchange_id = "podb"
      + display_name     = "JAPANESE STREET DATA"
      + documentation    = <<-EOT
            Prepper Open Data Bankは、様々な日本のオープンデータをデータプレップなしですぐ加工できるようにして提供しています。
            
            ※全データ本番公開済みです。BETA版は2023年末にクローズ予定です。
            
            Japanese Street Dataは、政府統計ポータルサイト「e-stat」で公開されている日本の国勢調査の町丁目（小地域）レベルの統計・空間データを、データ分析ですくに活用できる形にtruestarが収集・加工したものです。
            このデータには、性別、年齢層別、持ち家別に分類された総人口データ、学生・労働者人口データなどが含まれており、町丁目単位で利用することが可能です。分析者はこのデータを利用して、日本全国の人口動態や地理的要因について、高い粒度で様々な分析を容易に行うことができます。
            BIやGISツールを用いれば、町丁目データを活用したマッピング、分析、レポート作成が簡単に行え、地域ごとの市場ニーズ・特性の分析、需要予測など、様々な用途に活用することができます。
            
            SQLでの分析やシステム連携時に扱いやすいカラム名を持つテーブルと、TableauなどのBIツールで利用しやすい日本語および英語のカラム名にそれぞれ変更したビュー、計三種類をご用意しています。
            
            「町丁目ジオデータ【ST_CS20_GEO】」及び「町丁目マスタデータ【ST_CS20_MST】」では、実際にTableauを用いてデータを可視化したYouTube動画もご紹介しています。
            
            従来JAPANESE CENSUS&SPATIAL（略称：旧C&S）で公開していた町丁目レベルのデータも含まれます。
            
            
            詳細な定義: https://podb.truestar.co.jp/archives/str-data
            
            --
            株式会社 truestar が抽出、加工したデータ提供サービス Prepper Open Data Bank の BigQuery クローンです。
            BigQuery ユーザコミュニティ BQ FUN が加工して作成しています。BQ FUN および株式会社 truestar は、利用者が本コンテンツを用いて行う一切の責任を負いません。
            また、予告なく変更、削除される場合があります。
            
            このデータセットはCC BY 4.0で提供されています。
            https://creativecommons.org/licenses/by/4.0/legalcode.ja
        EOT
      + id               = (known after apply)
      + listing_id       = "japanese_street_data"
      + location         = "asia-northeast1"
      + name             = (known after apply)
      + primary_contact  = "https://bqfun.jp/docs/podb/"
      + project          = "jpdata"

      + bigquery_dataset {
          + dataset = "projects/120299025068/datasets/PODB_JAPANESE_STREET_DATA"
        }
    }

  # module.podb.google_bigquery_analytics_hub_listing.podb["PODB_JAPANESE_WEATHER_DATA"] will be created
  + resource "google_bigquery_analytics_hub_listing" "podb" {
      + data_exchange_id = "podb"
      + display_name     = "JAPANESE WEATHER DATA"
      + documentation    = <<-EOT
            Prepper Open Data Bankは、様々な日本のオープンデータをデータプレップなしですぐ加工できるようにして提供しています。
            
            Japanese Weather Dataは、気象庁の公表する全国の天気情報を提供しています。
            明日までの詳細な天気情報を提供するデータセット、1週間後までの降水確率などの基本情報を提供するデータセットなどを提供しています。また、それぞれのデータセットを結合することで、簡単に分析が行えます。
            
            PODBの気象データは、気象業務法で定める予報業務許可の対象にはなりません。「気象庁が出した予報をそのまま掲載する・伝えるまたはそれを解説する」ものであり、また出展の明記もあるため、特に問題ないと気象庁総務部総務課から直接確認を得て搭載しています。
            
            
            詳細な定義: https://podb.truestar.co.jp/archives/weather-data
            
            --
            株式会社 truestar が抽出、加工したデータ提供サービス Prepper Open Data Bank の BigQuery クローンです。
            BigQuery ユーザコミュニティ BQ FUN が加工して作成しています。BQ FUN および株式会社 truestar は、利用者が本コンテンツを用いて行う一切の責任を負いません。
            また、予告なく変更、削除される場合があります。
            
            このデータセットはCC BY 4.0で提供されています。
            https://creativecommons.org/licenses/by/4.0/legalcode.ja
        EOT
      + id               = (known after apply)
      + listing_id       = "japanese_weather_data"
      + location         = "asia-northeast1"
      + name             = (known after apply)
      + primary_contact  = "https://bqfun.jp/docs/podb/"
      + project          = "jpdata"

      + bigquery_dataset {
          + dataset = "projects/120299025068/datasets/PODB_JAPANESE_WEATHER_DATA"
        }
    }

  # module.podb.google_bigquery_data_transfer_config.cross_region["PODB_JAPANESE_CALENDAR_DATA"] will be created
  + resource "google_bigquery_data_transfer_config" "cross_region" {
      + data_source_id         = "cross_region_copy"
      + destination_dataset_id = "PODB_JAPANESE_CALENDAR_DATA"
      + display_name           = "PODB_JAPANESE_CALENDAR_DATA"
      + id                     = (known after apply)
      + location               = "asia-northeast1"
      + name                   = (known after apply)
      + params                 = {
          + "overwrite_destination_table" = "true"
          + "source_dataset_id"           = "PODB_JAPANESE_CALENDAR_DATA"
        }
      + project                = "jpdata"
      + service_account_name   = (known after apply)

      + schedule_options {
          + disable_auto_scheduling = true
        }
    }

  # module.podb.google_bigquery_data_transfer_config.cross_region["PODB_JAPANESE_CITY_DATA"] will be created
  + resource "google_bigquery_data_transfer_config" "cross_region" {
      + data_source_id         = "cross_region_copy"
      + destination_dataset_id = "PODB_JAPANESE_CITY_DATA"
      + display_name           = "PODB_JAPANESE_CITY_DATA"
      + id                     = (known after apply)
      + location               = "asia-northeast1"
      + name                   = (known after apply)
      + params                 = {
          + "overwrite_destination_table" = "true"
          + "source_dataset_id"           = "PODB_JAPANESE_CITY_DATA"
        }
      + project                = "jpdata"
      + service_account_name   = (known after apply)

      + schedule_options {
          + disable_auto_scheduling = true
        }
    }

  # module.podb.google_bigquery_data_transfer_config.cross_region["PODB_JAPANESE_CORPORATE_DATA"] will be created
  + resource "google_bigquery_data_transfer_config" "cross_region" {
      + data_source_id         = "cross_region_copy"
      + destination_dataset_id = "PODB_JAPANESE_CORPORATE_DATA"
      + display_name           = "PODB_JAPANESE_CORPORATE_DATA"
      + id                     = (known after apply)
      + location               = "asia-northeast1"
      + name                   = (known after apply)
      + params                 = {
          + "overwrite_destination_table" = "true"
          + "source_dataset_id"           = "PODB_JAPANESE_CORPORATE_DATA"
        }
      + project                = "jpdata"
      + service_account_name   = (known after apply)

      + schedule_options {
          + disable_auto_scheduling = true
        }
    }

  # module.podb.google_bigquery_data_transfer_config.cross_region["PODB_JAPANESE_LAND_PRICE_DATA"] will be created
  + resource "google_bigquery_data_transfer_config" "cross_region" {
      + data_source_id         = "cross_region_copy"
      + destination_dataset_id = "PODB_JAPANESE_LAND_PRICE_DATA"
      + display_name           = "PODB_JAPANESE_LAND_PRICE_DATA"
      + id                     = (known after apply)
      + location               = "asia-northeast1"
      + name                   = (known after apply)
      + params                 = {
          + "overwrite_destination_table" = "true"
          + "source_dataset_id"           = "PODB_JAPANESE_LAND_PRICE_DATA"
        }
      + project                = "jpdata"
      + service_account_name   = (known after apply)

      + schedule_options {
          + disable_auto_scheduling = true
        }
    }

  # module.podb.google_bigquery_data_transfer_config.cross_region["PODB_JAPANESE_MEDICAL_DATA"] will be created
  + resource "google_bigquery_data_transfer_config" "cross_region" {
      + data_source_id         = "cross_region_copy"
      + destination_dataset_id = "PODB_JAPANESE_MEDICAL_DATA"
      + display_name           = "PODB_JAPANESE_MEDICAL_DATA"
      + id                     = (known after apply)
      + location               = "asia-northeast1"
      + name                   = (known after apply)
      + params                 = {
          + "overwrite_destination_table" = "true"
          + "source_dataset_id"           = "PODB_JAPANESE_MEDICAL_DATA"
        }
      + project                = "jpdata"
      + service_account_name   = (known after apply)

      + schedule_options {
          + disable_auto_scheduling = true
        }
    }

  # module.podb.google_bigquery_data_transfer_config.cross_region["PODB_JAPANESE_MESH_DATA"] will be created
  + resource "google_bigquery_data_transfer_config" "cross_region" {
      + data_source_id         = "cross_region_copy"
      + destination_dataset_id = "PODB_JAPANESE_MESH_DATA"
      + display_name           = "PODB_JAPANESE_MESH_DATA"
      + id                     = (known after apply)
      + location               = "asia-northeast1"
      + name                   = (known after apply)
      + params                 = {
          + "overwrite_destination_table" = "true"
          + "source_dataset_id"           = "PODB_JAPANESE_MESH_DATA"
        }
      + project                = "jpdata"
      + service_account_name   = (known after apply)

      + schedule_options {
          + disable_auto_scheduling = true
        }
    }

  # module.podb.google_bigquery_data_transfer_config.cross_region["PODB_JAPANESE_PREFECTURE_DATA"] will be created
  + resource "google_bigquery_data_transfer_config" "cross_region" {
      + data_source_id         = "cross_region_copy"
      + destination_dataset_id = "PODB_JAPANESE_PREFECTURE_DATA"
      + display_name           = "PODB_JAPANESE_PREFECTURE_DATA"
      + id                     = (known after apply)
      + location               = "asia-northeast1"
      + name                   = (known after apply)
      + params                 = {
          + "overwrite_destination_table" = "true"
          + "source_dataset_id"           = "PODB_JAPANESE_PREFECTURE_DATA"
        }
      + project                = "jpdata"
      + service_account_name   = (known after apply)

      + schedule_options {
          + disable_auto_scheduling = true
        }
    }

  # module.podb.google_bigquery_data_transfer_config.cross_region["PODB_JAPANESE_STATION_AND_RAILWAY_DATA"] will be created
  + resource "google_bigquery_data_transfer_config" "cross_region" {
      + data_source_id         = "cross_region_copy"
      + destination_dataset_id = "PODB_JAPANESE_STATION_AND_RAILWAY_DATA"
      + display_name           = "PODB_JAPANESE_STATION_AND_RAILWAY_DATA"
      + id                     = (known after apply)
      + location               = "asia-northeast1"
      + name                   = (known after apply)
      + params                 = {
          + "overwrite_destination_table" = "true"
          + "source_dataset_id"           = "PODB_JAPANESE_STATION_AND_RAILWAY_DATA"
        }
      + project                = "jpdata"
      + service_account_name   = (known after apply)

      + schedule_options {
          + disable_auto_scheduling = true
        }
    }

  # module.podb.google_bigquery_data_transfer_config.cross_region["PODB_JAPANESE_STREET_DATA"] will be created
  + resource "google_bigquery_data_transfer_config" "cross_region" {
      + data_source_id         = "cross_region_copy"
      + destination_dataset_id = "PODB_JAPANESE_STREET_DATA"
      + display_name           = "PODB_JAPANESE_STREET_DATA"
      + id                     = (known after apply)
      + location               = "asia-northeast1"
      + name                   = (known after apply)
      + params                 = {
          + "overwrite_destination_table" = "true"
          + "source_dataset_id"           = "PODB_JAPANESE_STREET_DATA"
        }
      + project                = "jpdata"
      + service_account_name   = (known after apply)

      + schedule_options {
          + disable_auto_scheduling = true
        }
    }

  # module.podb.google_bigquery_data_transfer_config.cross_region["PODB_JAPANESE_WEATHER_DATA"] will be created
  + resource "google_bigquery_data_transfer_config" "cross_region" {
      + data_source_id         = "cross_region_copy"
      + destination_dataset_id = "PODB_JAPANESE_WEATHER_DATA"
      + display_name           = "PODB_JAPANESE_WEATHER_DATA"
      + id                     = (known after apply)
      + location               = "asia-northeast1"
      + name                   = (known after apply)
      + params                 = {
          + "overwrite_destination_table" = "true"
          + "source_dataset_id"           = "PODB_JAPANESE_WEATHER_DATA"
        }
      + project                = "jpdata"
      + service_account_name   = (known after apply)

      + schedule_options {
          + disable_auto_scheduling = true
        }
    }

  # module.podb.google_bigquery_dataset.cross_region["PODB_JAPANESE_CALENDAR_DATA"] will be created
  + resource "google_bigquery_dataset" "cross_region" {
      + creation_time              = (known after apply)
      + dataset_id                 = "PODB_JAPANESE_CALENDAR_DATA"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = false
      + effective_labels           = (known after apply)
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "asia-northeast1"
      + max_time_travel_hours      = (known after apply)
      + project                    = "jpdata"
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)
      + terraform_labels           = (known after apply)

      + access (known after apply)
    }

  # module.podb.google_bigquery_dataset.cross_region["PODB_JAPANESE_CITY_DATA"] will be created
  + resource "google_bigquery_dataset" "cross_region" {
      + creation_time              = (known after apply)
      + dataset_id                 = "PODB_JAPANESE_CITY_DATA"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = false
      + effective_labels           = (known after apply)
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "asia-northeast1"
      + max_time_travel_hours      = (known after apply)
      + project                    = "jpdata"
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)
      + terraform_labels           = (known after apply)

      + access (known after apply)
    }

  # module.podb.google_bigquery_dataset.cross_region["PODB_JAPANESE_CORPORATE_DATA"] will be created
  + resource "google_bigquery_dataset" "cross_region" {
      + creation_time              = (known after apply)
      + dataset_id                 = "PODB_JAPANESE_CORPORATE_DATA"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = false
      + effective_labels           = (known after apply)
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "asia-northeast1"
      + max_time_travel_hours      = (known after apply)
      + project                    = "jpdata"
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)
      + terraform_labels           = (known after apply)

      + access (known after apply)
    }

  # module.podb.google_bigquery_dataset.cross_region["PODB_JAPANESE_LAND_PRICE_DATA"] will be created
  + resource "google_bigquery_dataset" "cross_region" {
      + creation_time              = (known after apply)
      + dataset_id                 = "PODB_JAPANESE_LAND_PRICE_DATA"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = false
      + effective_labels           = (known after apply)
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "asia-northeast1"
      + max_time_travel_hours      = (known after apply)
      + project                    = "jpdata"
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)
      + terraform_labels           = (known after apply)

      + access (known after apply)
    }

  # module.podb.google_bigquery_dataset.cross_region["PODB_JAPANESE_MEDICAL_DATA"] will be created
  + resource "google_bigquery_dataset" "cross_region" {
      + creation_time              = (known after apply)
      + dataset_id                 = "PODB_JAPANESE_MEDICAL_DATA"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = false
      + effective_labels           = (known after apply)
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "asia-northeast1"
      + max_time_travel_hours      = (known after apply)
      + project                    = "jpdata"
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)
      + terraform_labels           = (known after apply)

      + access (known after apply)
    }

  # module.podb.google_bigquery_dataset.cross_region["PODB_JAPANESE_MESH_DATA"] will be created
  + resource "google_bigquery_dataset" "cross_region" {
      + creation_time              = (known after apply)
      + dataset_id                 = "PODB_JAPANESE_MESH_DATA"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = false
      + effective_labels           = (known after apply)
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "asia-northeast1"
      + max_time_travel_hours      = (known after apply)
      + project                    = "jpdata"
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)
      + terraform_labels           = (known after apply)

      + access (known after apply)
    }

  # module.podb.google_bigquery_dataset.cross_region["PODB_JAPANESE_PREFECTURE_DATA"] will be created
  + resource "google_bigquery_dataset" "cross_region" {
      + creation_time              = (known after apply)
      + dataset_id                 = "PODB_JAPANESE_PREFECTURE_DATA"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = false
      + effective_labels           = (known after apply)
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "asia-northeast1"
      + max_time_travel_hours      = (known after apply)
      + project                    = "jpdata"
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)
      + terraform_labels           = (known after apply)

      + access (known after apply)
    }

  # module.podb.google_bigquery_dataset.cross_region["PODB_JAPANESE_STATION_AND_RAILWAY_DATA"] will be created
  + resource "google_bigquery_dataset" "cross_region" {
      + creation_time              = (known after apply)
      + dataset_id                 = "PODB_JAPANESE_STATION_AND_RAILWAY_DATA"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = false
      + effective_labels           = (known after apply)
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "asia-northeast1"
      + max_time_travel_hours      = (known after apply)
      + project                    = "jpdata"
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)
      + terraform_labels           = (known after apply)

      + access (known after apply)
    }

  # module.podb.google_bigquery_dataset.cross_region["PODB_JAPANESE_STREET_DATA"] will be created
  + resource "google_bigquery_dataset" "cross_region" {
      + creation_time              = (known after apply)
      + dataset_id                 = "PODB_JAPANESE_STREET_DATA"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = false
      + effective_labels           = (known after apply)
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "asia-northeast1"
      + max_time_travel_hours      = (known after apply)
      + project                    = "jpdata"
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)
      + terraform_labels           = (known after apply)

      + access (known after apply)
    }

  # module.podb.google_bigquery_dataset.cross_region["PODB_JAPANESE_WEATHER_DATA"] will be created
  + resource "google_bigquery_dataset" "cross_region" {
      + creation_time              = (known after apply)
      + dataset_id                 = "PODB_JAPANESE_WEATHER_DATA"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = false
      + effective_labels           = (known after apply)
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "asia-northeast1"
      + max_time_travel_hours      = (known after apply)
      + project                    = "jpdata"
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)
      + terraform_labels           = (known after apply)

      + access (known after apply)
    }

  # module.podb.google_project_iam_member.cross_region will be created
  + resource "google_project_iam_member" "cross_region" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "jpdata"
      + role    = "roles/bigquery.admin"
    }

  # module.podb.google_service_account.cross_region will be created
  + resource "google_service_account" "cross_region" {
      + account_id = "podb-cross-region-copy"
      + disabled   = false
      + email      = (known after apply)
      + id         = (known after apply)
      + member     = (known after apply)
      + name       = (known after apply)
      + project    = "jpdata"
      + unique_id  = (known after apply)
    }

Plan: 33 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @na0fu3y, Action: `pull_request`, Working Directory: ``, Workflow: `.github/workflows/terraform_plan.yaml`*